Revit 2026 API

# ViewportRotation Enumeration

---

Rotation of the viewport

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewportRotation
```
```vb
Public Enumeration ViewportRotation
```
```cpp
public enum class ViewportRotation
```
```fsharp
type ViewportRotation
```

| Member name | Value | Description |
| --- | --- | --- |
| Clockwise | 1 | Viewport is rotated 90 degrees clockwise. |
| Counterclockwise | 2 | Viewport is rotated 90 degrees counterclockwise. |
| None | 0 | Viewport is not rotated. |

#### Reference

Autodesk.Revit.DB Namespace